# data Merging

In [1]:
import pandas as pd

In [3]:
data1 = {
    'id':[1,2,3],
    'name':['Ahmad','Fatima','Ali'],
    'age':[28,32,24]

}
df1 = pd.DataFrame(data1)
df1.head()

   id    name  age
0   1   Ahmad   28
1   2  Fatima   32
2   3     Ali   24

In [7]:
data2 = {
    'id':[1,2,3],
    'city':['Karachi','Lahore','Islamabad'],
    'occupation':['Engineer','Doctor','Teacher']
}
df2 = pd.DataFrame(data2)
df2.head()

   id       city occupation
0   1    Karachi   Engineer
1   2     Lahore     Doctor
2   3  Islamabad    Teacher

In [8]:
merged_df = pd.merge(df1,df2,on='id',how='inner')
merged_df

   id    name  age       city occupation
0   1   Ahmad   28    Karachi   Engineer
1   2  Fatima   32     Lahore     Doctor
2   3     Ali   24  Islamabad    Teacher

----
# Concatination

In [10]:
data1 = {'name':['Ahmad','Fatima','Ali'],
    'age':[28,32,24]}
data2 = {'name':['Isha','Usman','Aisha'],
    'age':[29,35,27]}
data3 = {'city':['Karachi','Lahore','Islamabad'],
    'Province':['Sindh','Punjab','KPK']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [11]:
print(df1)
print(df2)
print(df3)

     name  age
0   Ahmad   28
1  Fatima   32
2     Ali   24
    name  age
0   Isha   29
1  Usman   35
2  Aisha   27
        city Province
0    Karachi    Sindh
1     Lahore   Punjab
2  Islamabad      KPK

In [17]:
concatenated_rows = pd.concat([df1,df2])
concatenated_rows

     name  age
0   Ahmad   28
1  Fatima   32
2     Ali   24
0    Isha   29
1   Usman   35
2   Aisha   27

In [16]:
concatenated_column = pd.concat([df1,df3],axis=1)
concatenated_column

     name  age       city Province
0   Ahmad   28    Karachi    Sindh
1  Fatima   32     Lahore   Punjab
2     Ali   24  Islamabad      KPK